Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
#ifdef AT32F421K8U7
#include "at32f421.h"
#endif
#ifdef AT32F415K8U7
#include "at32f415.h"
#endif


//#include "systick.h"
#include <stdio.h>
#include "main.h"

#include "targets.h"
#include "signal.h"
#include "dshot.h"
#include "phaseouts.h"
#include "eeprom.h"
#include "sounds.h"
#include "ADC.h"
#ifdef USE_SERIAL_TELEMETRY
#include "serial_telemetry.h"
#endif
#include "IO.h"
#include "comparator.h"
#include "functions.h"
#include "peripherals.h"
#include "common.h"
#include "firmwareversion.h"



uint16_t comp_change_time = 0;


//firmware build options !! fixed speed and duty cycle modes are not to be used with sinusoidal startup !!

#define POWER_ON_TEST_MODE       // bypasses signal input and arming for bench motor testing
#define POWER_ON_TEST_POWER 10   // 0-100 percent, bounded by the startup fault latch below
#define POWER_ON_TEST_MOTOR_KV 1400
#define POWER_ON_TEST_MOTOR_POLES 14
#define POWER_ON_TEST_MIN_STARTUP_DUTY 160
#define POWER_ON_TEST_STARTUP_MAX_DUTY 480
#define POWER_ON_TEST_ADVANCE_LEVEL 0
#define POWER_ON_TEST_FORWARD 1
// Ramp forced commutation only long enough to acquire BEMF. If acquisition
// fails, latch the bridge off instead of driving a stalled motor indefinitely.
#define POWER_ON_TEST_COMM_TIMEOUT_START 20000
#define POWER_ON_TEST_COMM_TIMEOUT_MIN 3000
#define POWER_ON_TEST_COMM_TIMEOUT_RAMP_PERCENT 96
#define POWER_ON_TEST_BEMF_ACQUIRE_INTERVAL 3500
#define POWER_ON_TEST_MAX_FORCED_STEPS 90
#define POWER_ON_TEST_MAX_ACQUIRE_TIMEOUTS 18
#define POWER_ON_TEST_REQUIRED_VALID_ZC 12
#define POWER_ON_TEST_ALIGNMENT_MS 200
#define POWER_ON_TEST_MIN_BEMF_COUNTS 4
#define POWER_ON_TEST_INTERRUPT_COMM_INTERVAL 2000

#ifdef POWER_ON_TEST_MODE
#define FIXED_DUTY_MODE
#define FIXED_DUTY_MODE_POWER POWER_ON_TEST_POWER
#endif

//#define FIXED_DUTY_MODE  // bypasses signal input and arming, uses a set duty cycle. For pumps, slot cars etc
//#define FIXED_DUTY_MODE_POWER 10     // 0-100 percent not used in fixed speed mode

//#define FIXED_SPEED_MODE  // bypasses input signal and runs at a fixed rpm using the speed control loop PID
//#define FIXED_SPEED_MODE_RPM  1000  // intended final rpm , ensure pole pair numbers are entered correctly in config tool.

//#define BRUSHED_MODE         // overrides all brushless config settings, enables two channels for brushed control
//#define GIMBAL_MODE     // also sinusoidal_startup needs to be on, maps input to sinusoidal angle.

//===========================================================================
//=============================  Defaults =============================
//===========================================================================

uint8_t drive_by_rpm = 0;
uint32_t MAXIMUM_RPM_SPEED_CONTROL = 12000;
uint32_t MINIMUM_RPM_SPEED_CONTROL = 2000;

 //assign speed control PID values values are x10000
 fastPID speedPid = {      //commutation speed loop time
 		.Kp = 10,
 		.Ki = 0,
 		.Kd = 100,
 		.integral_limit = 10000,
 		.output_limit = 50000
 };

 fastPID currentPid = {   // 1khz loop time
 		.Kp = 800,
 		.Ki = 0,
 		.Kd = 1000,
 		.integral_limit = 20000,
 		.output_limit = 100000
 };

 fastPID stallPid = {          //1khz loop time
 		.Kp = 2,
 		.Ki = 0,
 		.Kd = 50,
 		.integral_limit = 10000,
 		.output_limit = 50000
 };

uint16_t target_e_com_time_high;
uint16_t target_e_com_time_low;

char eeprom_layout_version = 2;
char dir_reversed = 0;
char comp_pwm = 1;
char VARIABLE_PWM = 1;
char bi_direction = 0;
char stuck_rotor_protection = 1;	// Turn off for Crawlers
char brake_on_stop = 0;
uint16_t stop_counter_for_alloff=0; //the counter for pwm off for 0 input
char stall_protection = 0;
char use_sin_start = 0;
char TLM_ON_INTERVAL = 0;
uint8_t telemetry_interval_ms = 30;
uint8_t TEMPERATURE_LIMIT = 255;  // degrees 255 to disable
char advance_level = 2;			// 7.5 degree increments 0 , 7.5, 15, 22.5)
uint16_t motor_kv = 2000;
char motor_poles = 14;
uint16_t CURRENT_LIMIT = 202;
uint8_t sine_mode_power = 5;
char drag_brake_strength = 10;		// Drag Brake Power when brake on stop is enabled
uint8_t driving_brake_strength = 10;
uint8_t dead_time_override = DEAD_TIME;
char sine_mode_changeover_thottle_level = 5;	// Sine Startup Range
uint16_t stall_protect_target_interval = TARGET_STALL_PROTECTION_INTERVAL;
char USE_HALL_SENSOR = 0;
uint16_t enter_sine_angle = 180;

//============================= Servo Settings ==============================
uint16_t servo_low_threshold = 1100;	// anything below this point considered 0
uint16_t servo_high_threshold = 1900;	// anything above this point considered 2000 (max)
uint16_t servo_neutral = 1500;
uint8_t servo_dead_band = 100;

//========================= Battery Cuttoff Settings ========================
char LOW_VOLTAGE_CUTOFF = 0;		// Turn Low Voltage CUTOFF on or off
uint16_t low_cell_volt_cutoff = 330;	// 3.3volts per cell

//=========================== END EEPROM Defaults ===========================

//typedef struct __attribute__((packed)) {
//  uint8_t version_major;
//  uint8_t version_minor;
//  char device_name[12];
//} firmware_info_s;

//firmware_info_s __attribute__ ((section(".firmware_info"))) firmware_info = {
//  version_major: VERSION_MAJOR,
//  version_minor: VERSION_MINOR,
//  device_name: FIRMWARE_NAME
//};

uint8_t EEPROM_VERSION;
//move these to targets folder or peripherals for each mcu
char RC_CAR_REVERSE = 0;   // have to set bidirectional, comp_pwm off and stall protection off, no sinusoidal startup
uint16_t ADC_CCR = 30;
uint16_t current_angle = 90;
uint16_t desired_angle = 90;


//assign current control PID values

//PID speedPid = {
//		.Kp = 0.001,
//		.Ki = 0,
//		.Kd = 0.010,
//		.integral_limit = 1,
//		.output_limit = 5
//};
//
//PID currentPid = {
//		.Kp = 0.04,
//		.Ki = 0,
//		.Kd = 0.05,
//		.integral_limit = 2,
//		.output_limit = 10
//};
//
//PID stallPid = {
//		.Kp = 0.0002,
//		.Ki = 0.00000001,
//		.Kd = 0.05,
//		.integral_limit = 1,
//		.output_limit = 5
//};
char boot_up_tune_played = 0;
uint16_t target_e_com_time = 0;
int16_t Speed_pid_output;
char use_speed_control_loop = 0;
float input_override = 0;
int16_t	use_current_limit_adjust = 2000;
char use_current_limit = 0;
float stall_protection_adjust = 0;

uint32_t MCU_Id = 0;
uint32_t REV_Id = 0;

