Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
	   }
	   
	   if(eepromBuffer[44] > 0 && eepromBuffer[44] < 100){
	   CURRENT_LIMIT = eepromBuffer[44] * 2;
	   use_current_limit = 1;
	   
	   }
	   if(eepromBuffer[45] > 0 && eepromBuffer[45] < 11){ 
	   sine_mode_power = eepromBuffer[45];
	   }
	   /*if(eepromBuffer[46] >= 0 && eepromBuffer[46] < 10){
		   switch (eepromBuffer[46]){
		   case AUTO_IN:
			   dshot= 0;
			   servoPwm = 0;
			   EDT_ARMED = 1;
			   break;
		   case DSHOT_IN:
			   dshot = 1;
			   EDT_ARMED = 1;
			   break;
		   case SERVO_IN:
			   servoPwm = 1;
			   break;
		   case SERIAL_IN:
			   break;
		   case EDTARM:
			   EDT_ARM_ENABLE = 1;
			   EDT_ARMED = 0;
			   dshot = 1;
			   break;
		   };
	   }else{
		   dshot = 0;
		   servoPwm = 0;
		   EDT_ARMED = 1;
	   }*/
       if(motor_kv < 300){
		   low_rpm_throttle_limit = 0;
	   }
		if((motor_kv < 1500)|| (stall_protection)){
			min_bemf_counts_up = TARGET_MIN_BEMF_COUNTS *2;
			min_bemf_counts_down = TARGET_MIN_BEMF_COUNTS *2;
		}
	   low_rpm_level  = motor_kv / 100 / (32 / motor_poles);
	   high_rpm_level = motor_kv / 17 / (32/motor_poles);
	   }
	   reverse_speed_threshold =  map(motor_kv, 300, 3000, 2500 , 1250);
	if(!comp_pwm){
		bi_direction = 0;
	}
	
	VARIABLE_PWM_MIN_ARR=map(motor_kv, 2800, 4800, TIMER1_MAX_ARR/2 , TIMER1_MAX_ARR/3);



}

void saveEEpromSettings(){    

   eepromBuffer[1] = eeprom_layout_version;
   if(dir_reversed == 1){
	   eepromBuffer[17] = 0x01;
   }else{
	   eepromBuffer[17] = 0x00;
   }
   if(bi_direction == 1){
	   eepromBuffer[18] = 0x01;
      }else{
    	  eepromBuffer[18] = 0x00;
      }
   if(use_sin_start == 1){
	   eepromBuffer[19] = 0x01;
      }else{
    	  eepromBuffer[19] = 0x00;
      }

   if(comp_pwm == 1){
	   eepromBuffer[20] = 0x01;
      }else{
    	  eepromBuffer[20] = 0x00;
      }
   if(VARIABLE_PWM == 1){
	   eepromBuffer[21] = 0x01;
      }else{
    	  eepromBuffer[21] = 0x00;
      }
   if(stuck_rotor_protection == 1){
	   eepromBuffer[22] = 0x01;
      }else{
    	  eepromBuffer[22] = 0x00;
      }
   eepromBuffer[23] = advance_level;
   save_flash_nolib(eepromBuffer, 176, EEPROM_START_ADD);
}



void getSmoothedInput() {

		total = total - readings[readIndex];
		readings[readIndex] = commutation_interval;
		total = total + readings[readIndex];
		readIndex = readIndex + 1;
		if (readIndex >= numReadings) {
			readIndex = 0;
		}
		smoothedinput = total / numReadings;


}

void getBemfState(){
	uint8_t current_state = 0;
#ifdef MCU_AT415
	 current_state = !(CMP->ctrlsts1_bit.cmp1value);  // polarity reversed
#else
    current_state = !(CMP->ctrlsts_bit.cmpvalue);  // polarity reversed
#endif
    if (rising){
    	if (current_state){
    		bemfcounter++;
    		}else{
    		bad_count++;
    		if(bad_count > bad_count_threshold){
    		bemfcounter = 0;
    		}
   	}
    }else{
    	if(!current_state){
    		bemfcounter++;
    	}else{
    		bad_count++;
    	    if(bad_count > bad_count_threshold){
    	    bemfcounter = 0;
    	  }
    	}
    }
#ifdef POWER_ON_TEST_MODE
	if(bemfcounter > power_on_test_bemf_peak){
		power_on_test_bemf_peak = bemfcounter;
	}
#endif
}


void commutate(){
	inner_step=0;
	commutation_intervals[step-1] = commutation_interval;
	e_com_time = (commutation_intervals[0] + commutation_intervals[1] + commutation_intervals[2] + commutation_intervals[3] + commutation_intervals[4] +commutation_intervals[5]) >> 1;  // COMMUTATION INTERVAL IS 0.5US INCREMENTS

	if (forward == 1){
		step++;
		if (step > 6) {
			step = 1;
			desync_check = 1;
		}
		rising = step % 2;
	}else{
		step--;
		if (step < 1) {
			step = 6;
			desync_check = 1;
		}
		rising = !(step % 2);
	}
/***************************************************/
	UTILITY_TIMER->cval = 0;
	if(!prop_brake_active){
	comStep(step);
	}
  comp_change_time = UTILITY_TIMER->cval;
/****************************************************/
	changeCompInput();
  if(average_interval > 2000 && (stall_protection || RC_CAR_REVERSE)){
	old_routine = 1;
}
	bemfcounter = 0;
	zcfound = 0;
	  if(use_speed_control_loop && running){
	  input_override += doPidCalculations(&speedPid, e_com_time, target_e_com_time)/10000;
	  if(input_override > 2000){
		  input_override = 2000;
	  }
	  if(input_override < 0){
		  input_override = 0;
	  }
	  if(zero_crosses < 100){
		  speedPid.integral = 0;
	  }
}		
}

void PeriodElapsedCallback(){
	    COM_TIMER->iden &= ~TMR_OVF_INT; // disable interrupt         

			commutate();

			if(!old_routine){
			enableCompInterrupts();     // enable comp interrupt
			}
#ifdef POWER_ON_TEST_MODE
			power_on_test_acquire_timeouts = 0;
#endif
			if(zero_crosses<10000){
			zero_crosses++;
			
			}

}
#if defined(USE_DEBUG)
int max_bad_count=0;
int debug_passed_time=0;
int min_commutation_interval=999999;
int debug_desync_max_diff_ratio=0;
#endif

void interruptRoutine(){
	if (average_interval > 125){
		if ((INTERVAL_TIMER->cval < 125) && (duty_cycle < 600) && (zero_crosses < 500)){    //should be impossible, desync?exit anyway
			return;
		}
		if(commutation_interval>1000){
			if ((INTERVAL_TIMER->cval < (commutation_interval / 2 ))){
				return;
			}
		}else{
			if ((INTERVAL_TIMER->cval < (commutation_interval / 4))){
				return;
			}
		}
		stuckcounter++;             // stuck at 100 interrupts before the main loop happens again.
		if (stuckcounter > 100){
			maskPhaseInterrupts();
			zero_crosses = 0;
			return;
		}
	}
	if(INTERVAL_TIMER->cval < 10){//about 285710 rpm for 14-poles motor
		return;
	}

		/*int prevtime=INTERVAL_TIMER->cval;
		for(int i=0;i<2;++i){
			while(prevtime==INTERVAL_TIMER->cval){
				if((rising && CMP_VALUE) || (!rising && !CMP_VALUE)){
					return;
				}
			}
			prevtime=INTERVAL_TIMER->cval;
		}*/
#if defined(FAST_INTERRUPT)
		thiszctime = INTERVAL_TIMER->cval;
		if(rising){
			for(int i = 0; i < filter_level; i++){
					if(CMP_VALUE){
						return;
					}
			}
		}else{
			for(int i = 0; i < filter_level; i++){
					if(!CMP_VALUE){
						return;
					}
			}
		}
#else
		for(int n=0;n<2;++n){
			thiszctime = INTERVAL_TIMER->cval;
			int badcount=0;
			if(rising){
				for(int i = 0; i < filter_level*4; i++){
						if(CMP_VALUE){
							++badcount;
						}
				}
			}else{
				for(int i = 0; i < filter_level*4; i++){
						if(!CMP_VALUE){
							++badcount;
						}
				}
			}
#if defined(USE_DEBUG)
			if(badcount>max_bad_count){
				max_bad_count=badcount;
			}
#endif

			if(badcount>filter_level){//if badcount > 1/4*total test
				if(n==1){
					return;
				}
			}else{
				break;
			}
		}
#endif
		
