Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
			int passed_time=INTERVAL_TIMER->cval - thiszctime;
			INTERVAL_TIMER->cval = passed_time;
#if defined(USE_DEBUG)
			debug_passed_time=passed_time;
#endif

		  commutation_interval = thiszctime;
		  //commutation_interval = (( 3*commutation_interval) + thiszctime)>>2;
		
			int c1=commutation_interval;

			
			//commutation_interval = (commutation_interval+thiszctime)>>1;
			//commutation_interval = (( 3*commutation_interval) + thiszctime)>>2;			
			int next_commutation_interval=commutation_interval;
		
#if defined(USE_DEBUG)
			if(min_commutation_interval>commutation_interval){
				min_commutation_interval=commutation_interval;
			}
#endif
			
			if(fast_accel){
					int c2;
					if(average_interval>800){
						c2=c1;
					}else if(average_interval>300){
						c2=c1/2;
					}else{
						c2=c1/3;
					}
					next_commutation_interval=c2;
			}
			advance = (next_commutation_interval>>3) * advance_level;   // 60 divde 8 7.5 degree increments
			waitTime = (next_commutation_interval >>1)  - advance;
			
			inner_step=-1;
			maskPhaseInterrupts();						
			//waitTime = waitTime >> fast_accel;
			COM_TIMER->cval = INTERVAL_TIMER->cval;//already passed INTERVAL_TIMER->cval
			if(waitTime<INTERVAL_TIMER->cval+2){
				waitTime=INTERVAL_TIMER->cval+2;
			}
			COM_TIMER->pr = waitTime;
			COM_TIMER->ists = 0x00;
			COM_TIMER->iden |= TMR_OVF_INT;
}

void startMotor() {
	if (running == 0){
#ifdef POWER_ON_TEST_MODE
	if (power_on_test_fault){
		return;
	}
	power_on_test_forced_steps = 0;
	power_on_test_bemf_peak = 0;
	power_on_test_zero_cross_peak = 0;
	power_on_test_valid_zero_crosses = 0;
	power_on_test_acquire_timeouts = 0;
	power_on_test_closed_loop = 0;
	comm_timeout = POWER_ON_TEST_COMM_TIMEOUT_START;
	// startMotor() runs before the normal duty calculation in the main loop.
	// Preload the test duty here so the alignment hold produces real torque.
	duty_cycle = startup_max_duty_cycle;
	adjusted_duty_cycle = startup_max_duty_cycle;
	last_adjusted_duty_cycle = startup_max_duty_cycle;
	setPwmRatio();
#endif
	commutate();
#ifdef POWER_ON_TEST_MODE
	// Hold one electrical sector so the rotor starts the acceleration ramp
	// from a known position. The interval ISR ignores overflow while running=0.
	WDT->cmd = WDT_CMD_RELOAD;
	delayMillis(POWER_ON_TEST_ALIGNMENT_MS);
	WDT->cmd = WDT_CMD_RELOAD;
#endif
	commutation_interval = 10000;
	INTERVAL_TIMER->cval = 5000;
	running = 1;
	}
	#ifdef POWER_ON_TEST_MODE
	old_routine = 1;
	maskPhaseInterrupts();
	#else
	enableCompInterrupts();
	#endif
}

void stopStuckMotor(){
	#ifdef POWER_ON_TEST_MODE
		running = 0;
		COM_TIMER->iden &= ~TMR_OVF_INT;
		adjusted_duty_cycle = 0;
		last_adjusted_duty_cycle = 0;
		setPwmRatio();
	#endif
		allOff();
		maskPhaseInterrupts();
		input = 0;
		bemf_timeout_happened = 102;
#ifdef USE_RGB_LED
			GPIOB->BRR = LL_GPIO_PIN_8; // on red
			GPIOB->BSRR = LL_GPIO_PIN_5;  //
			GPIOB->BSRR = LL_GPIO_PIN_3;
#endif
}

void zcfoundroutine(uint8_t forced_commutation);
void commutateProcess(uint8_t real_zero_cross);
void IntervalTimerOverflowProcess(int commutateRightNow){
	bemf_timeout_happened++;
#ifdef POWER_ON_TEST_MODE
	if(!commutateRightNow){
		if(power_on_test_forced_steps < 255){
			power_on_test_forced_steps++;
		}
		power_on_test_valid_zero_crosses = 0;
		power_on_test_closed_loop = 0;

		if(comm_timeout <= POWER_ON_TEST_BEMF_ACQUIRE_INTERVAL){
			if(power_on_test_acquire_timeouts < 255){
				power_on_test_acquire_timeouts++;
			}
		}else{
			power_on_test_acquire_timeouts = 0;
		}
		if(power_on_test_forced_steps >= POWER_ON_TEST_MAX_FORCED_STEPS){
			power_on_test_fault = 1;
			stopStuckMotor();
			return;
		}
		if(power_on_test_acquire_timeouts >= POWER_ON_TEST_MAX_ACQUIRE_TIMEOUTS){
			power_on_test_fault = 1;
			stopStuckMotor();
			return;
		}

		// Accelerate the open-loop fallback so the motor can generate enough
		// BEMF for the polling detector to acquire a real zero crossing.
		if(comm_timeout > POWER_ON_TEST_COMM_TIMEOUT_MIN){
			comm_timeout = comm_timeout * POWER_ON_TEST_COMM_TIMEOUT_RAMP_PERCENT / 100;
			if(comm_timeout < POWER_ON_TEST_COMM_TIMEOUT_MIN){
				comm_timeout = POWER_ON_TEST_COMM_TIMEOUT_MIN;
			}
		}
	}
#endif
	//set pwm as bemf_timeout_happened changed
	setPwmRatio();
	const int bemf_timeout=100;
	if(bemf_timeout_happened > bemf_timeout * ( 1 + (crawler_mode*100)) && stuck_rotor_protection){
		stopStuckMotor();
		return;
	}

	maskPhaseInterrupts();
	old_routine = 1;
	if(input < 48){
	 running = 0;
	}
	zero_crosses = 0;
	if(commutateRightNow){
		commutateProcess(0);
	}else{
		zcfoundroutine(1);
	}
	
 // if(stall_protection){
	 // min_startup_duty = 130;
	 // minimum_duty_cycle = minimum_duty_cycle + 10;
	 // if(minimum_duty_cycle > 80){
		 // minimum_duty_cycle = 80;
	 // }
 // }

}

//interval timer overflow process, in case main loop is stucked and the zc timeout escaped
int intervaloverflowcount=0;
void IntervalTimerOverflow(){
	if(running){
		IntervalTimerOverflowProcess(1);
		#if defined(USE_DEBUG)
			++intervaloverflowcount;
		#endif
	}
}


void tenKhzRoutine(){
	tenkhzcounter++;
	
		  if(boot_up_tune_played == 0){
			if(tenkhzcounter > 1000){ 
			playStartupTune();
			boot_up_tune_played = 1;
			}
	  }
	
	if(tenkhzcounter > 10000){      // 1s sample interval
		consumed_current = (float)actual_current/360 + consumed_current;
							switch (dshot_extended_telemetry){

					case 1:
					    send_extended_dshot = 0x0200 | degrees_celsius;
					    dshot_extended_telemetry = 2;
					break;
					case 2:
					    send_extended_dshot = 0x0600 | ((uint8_t)actual_current / 50);
					    dshot_extended_telemetry = 3;
					break;
					case 3:
					    send_extended_dshot = 0x0400 | (uint8_t)(battery_voltage / 25);
					    dshot_extended_telemetry = 1;
					break;

					}
		tenkhzcounter = 0;
	}
if(!armed){
	if(inputSet){
		if(adjusted_input == 0){
			armed_timeout_count++;
			if(armed_timeout_count > 10000){    // one second
				if(zero_input_count > 30){
					armed = 1;
		//			receiveDshotDma();
					#ifdef USE_RGB_LED
									GPIOB->BRR = LL_GPIO_PIN_3;    // turn on green
									GPIOB->BSRR = LL_GPIO_PIN_8;   // turn on green
									GPIOB->BSRR = LL_GPIO_PIN_5;
					#endif
									if(cell_count == 0 && LOW_VOLTAGE_CUTOFF){
										cell_count = battery_voltage / 370;
										for (int i = 0 ; i < cell_count; i++){
										playInputTune();
										delayMillis(100);
		//			  			 IWDG_ReloadCounter(IWDG);
										}
										}else{
										playInputTune();
										}
									if(!servoPwm){
										RC_CAR_REVERSE = 0;
									}
						int batcellcount=battery_voltage / 370;
						if(batcellcount<=0){
							batcellcount=4;
						}
						targetmax_rpm=(int)motor_kv*batcellcount*42/10;
						int targetrpmlow=2000*6*42/10;
						int targetrpmhigh=3500*6*42/10;
						target_rampratio_mul10=map(targetmax_rpm,targetrpmlow,targetrpmhigh,10,6);
				}else{
					inputSet = 0;
					armed_timeout_count =0;
				}
			}
		}else{
			armed_timeout_count =0;
		}
	}
}

	if(TLM_ON_INTERVAL){
		telem_ms_count++;
		if(telem_ms_count>telemetry_interval_ms*10){
			send_telemetry = 1;
			telem_ms_count = 0;
		}
	}
#ifndef BRUSHED_MODE
	if(!stepper_sine){
	  if (input >= 47 +(80*use_sin_start) && armed){
			stop_counter_for_alloff=0;
		  if (running == 0){
			  allOff();
			  if(!old_routine){
			 startMotor();
			  }
			  running = 1;
			  last_duty_cycle = min_startup_duty;

