Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
		  }
	  if(use_sin_start){
		duty_cycle = map(input, 137, 2047, minimum_duty_cycle, TIMER1_MAX_ARR);
  	  }else{
	 	 duty_cycle = map(input, 47, 2047, minimum_duty_cycle, TIMER1_MAX_ARR);
	  }
	  if(tenkhzcounter%10 == 0){     // 1khz PID loop
		  if(use_current_limit && running){
			use_current_limit_adjust -= (int16_t)(doPidCalculations(&currentPid, actual_current, CURRENT_LIMIT*100)/10000);
			if(use_current_limit_adjust < minimum_duty_cycle){
				use_current_limit_adjust = minimum_duty_cycle;
			}
			if(use_current_limit_adjust > duty_cycle){
				use_current_limit_adjust = duty_cycle;
			}

	  }

		  	 if(stall_protection && running ){  // this boosts throttle as the rpm gets lower, for crawlers and rc cars only, do not use for multirotors.
		  		 stall_protection_adjust += (doPidCalculations(&stallPid, commutation_interval, stall_protect_target_interval))/10000;
		  					 if(stall_protection_adjust > 150){
		  						stall_protection_adjust = 150;
		  					 }
		  					 if(stall_protection_adjust <= 0){
		  						stall_protection_adjust = 0;
		  					 }
		  	 }
	  }
	  if(!RC_CAR_REVERSE){
		  prop_brake_active = 0;
	  }
	  }
	  if (input < 47 + (80*use_sin_start)){
		if(play_tone_flag != 0){
			if(play_tone_flag == 1){
				playDefaultTone();

			}if(play_tone_flag == 2){
				playChangedTone();
			}
			play_tone_flag = 0;
		}

		  if(!comp_pwm){
			duty_cycle = 0;
			if(!running){
				old_routine = 1;
				zero_crosses = 0;
				  if(brake_on_stop){
					  fullBrake();
				  }else{
					  if(!prop_brake_active){
					  allOff();
					  }
				  }
			}
			if (RC_CAR_REVERSE && prop_brake_active) {
#ifndef PWM_ENABLE_BRIDGE
					duty_cycle = getAbsDif(1000, newinput) + 1000;
					if(duty_cycle == 2000){
						fullBrake();
					}else{
						proportionalBrake();
					}
#endif
					}
		  }else{
		  if (!running){
			  duty_cycle = 0;
			  old_routine = 1;
			  zero_crosses = 0;
			  bad_count = 0;
			  	  if(brake_on_stop){
			  		  if(!use_sin_start){
#ifndef PWM_ENABLE_BRIDGE				
			  			  duty_cycle = (TIMER1_MAX_ARR-19) + drag_brake_strength*2;
			  			  proportionalBrake();
			  			  prop_brake_active = 1;
#else
	//todo add proportional braking for pwm/enable style bridge.
#endif
			  		  }
			  	  }else{							
							if(stop_counter_for_alloff>1000){
								allOff();
							}else{
								++stop_counter_for_alloff;
							}
			  		  duty_cycle = 0;
			  	  }
		  }

		  	  phase_A_position = ((step-1) * 60) + enter_sine_angle;
		  	  if(phase_A_position > 359){
		  		  phase_A_position -= 360;
		  	  }
		  	  phase_B_position = phase_A_position +  119;
		  	  if(phase_B_position > 359){
		  		  phase_B_position -= 360;
		  	  }
		  	  phase_C_position = phase_A_position + 239;
		  	 if(phase_C_position > 359){
		  	 phase_C_position -= 360;
		  	 }

		 	  if(use_sin_start == 1){
		    	 stepper_sine = 1;
		 	  }
		  }
		  }
if(!prop_brake_active){
#ifdef POWER_ON_TEST_MODE
	// Hold a short, bounded 24% startup torque until BEMF is genuinely locked.
	if(!power_on_test_closed_loop && !power_on_test_fault && running){
		duty_cycle = startup_max_duty_cycle;
	}
#endif
 if (zero_crosses < (20 >> stall_protection)){
	   if (duty_cycle < min_startup_duty){
	   duty_cycle = min_startup_duty;

	   }
	   if (duty_cycle > startup_max_duty_cycle){
		   duty_cycle = startup_max_duty_cycle;
	   }
 }

	 if (duty_cycle > duty_cycle_maximum){
		 duty_cycle = duty_cycle_maximum;
	 }
	 if(use_current_limit){
		 if (duty_cycle > use_current_limit_adjust){
			 duty_cycle = use_current_limit_adjust;
		 }
	 }

	 if(stall_protection_adjust > 0){

		 duty_cycle = duty_cycle + (uint16_t)stall_protection_adjust;
	 }

	 if(maximum_throttle_change_ramp){
		 	int ramp_ratio;
		  if(duty_cycle<TIMER1_MAX_ARR/10*1){
				ramp_ratio=1;
			}else {
				if(average_interval>500){
					ramp_ratio=2;
				}else{
					ramp_ratio=4;
				}
			}
				
		  int max_duty_cycle_change = 2;
	//	max_duty_cycle_change = map(k_erpm, low_rpm_level, high_rpm_level, 1, 40);
			if(average_interval > 500){
				max_duty_cycle_change = 15*ramp_ratio;
			}else{
				max_duty_cycle_change = 45*ramp_ratio;
			}
#if defined(USE_KV_VBAT_RAMP)
			if(target_rampratio_mul10>0){
				max_duty_cycle_change=max_duty_cycle_change*target_rampratio_mul10/10;
				if(max_duty_cycle_change<2)max_duty_cycle_change=2;
			}
#endif
			
			int max_duty_cycle_change_dec;
			if(average_interval > 500){
				max_duty_cycle_change_dec = 20*ramp_ratio;
			}else{
				max_duty_cycle_change_dec = 60*ramp_ratio;
			}
			
			 if ((duty_cycle - last_duty_cycle) > max_duty_cycle_change){
				duty_cycle = last_duty_cycle + max_duty_cycle_change;
				fast_accel = 1;
				/*if(commutation_interval > 500){
					fast_accel = 1;
				}else{
					fast_accel = 0;
				}*/
			}else if ((last_duty_cycle - duty_cycle) > max_duty_cycle_change_dec){
				duty_cycle = last_duty_cycle - max_duty_cycle_change_dec;
				fast_accel = 0;
			}else{
				fast_accel = 0;
			}
			if(average_interval>1000){
				if(duty_cycle>TIMER1_MAX_ARR/2){
					duty_cycle=TIMER1_MAX_ARR/2;
				}
			}
			/*if(e_com_time > 10 * 1000000/(targetmax_rpm/60*motor_poles/2)){// 1/10 max speed
				if(duty_cycle>TIMER1_MAX_ARR/2){//limit to half max duty
					duty_cycle=TIMER1_MAX_ARR/2;
				}
			}*/
		}
	}
		if ((armed && running) && input > 47){
			if(VARIABLE_PWM){
				//tim1_arr = map(commutation_interval, 96, 200, TIMER1_MAX_ARR/2, TIMER1_MAX_ARR);				
				tim1_arr = map(commutation_interval, 150, 750, VARIABLE_PWM_MIN_ARR, TIMER1_MAX_ARR);
			}
			adjusted_duty_cycle = ((duty_cycle * tim1_arr)/TIMER1_MAX_ARR)+1;
		}else{
				if(prop_brake_active){
					adjusted_duty_cycle = TIMER1_MAX_ARR - ((duty_cycle * tim1_arr)/TIMER1_MAX_ARR)+1;
				}else{
				adjusted_duty_cycle = DEAD_TIME * running;
				}
	    }
		last_duty_cycle = duty_cycle;
		TMR1->pr = tim1_arr;

	last_adjusted_duty_cycle=adjusted_duty_cycle;
	setPwmRatio();
	}
average_interval = e_com_time / 3;
if(desync_check && zero_crosses > 10){
//	if(average_interval < last_average_interval){
//
//	}
		int diff=getAbsDif(last_average_interval,average_interval);
#if defined(USE_DEBUG)
		int diffratio=diff*10000/average_interval;
		if( average_interval < 2000 && debug_desync_max_diff_ratio<diffratio){
			debug_desync_max_diff_ratio=diffratio;
		}
#endif
		if((diff > average_interval>>1) && (average_interval < 2000)){ //throttle resitricted before zc 20.
		zero_crosses = 0;
		desync_happened ++;
		running = 0;
		old_routine = 1;
			if(zero_crosses > 100){
				average_interval = 5000;
			}
		last_duty_cycle = min_startup_duty/2;
		}
		desync_check = 0;
//	}
	last_average_interval = average_interval;
	}
//#ifndef MCU_F031
//if(commutation_interval > 400){
//	   NVIC_SetPriority(IC_DMA_IRQ_NAME, 0);
//	   NVIC_SetPriority(ADC_CMP_IRQn, 1);
//}else{
//	NVIC_SetPriority(IC_DMA_IRQ_NAME, 1);
//	NVIC_SetPriority(ADC_CMP_IRQn, 0);
//}
//#endif   //mcu f031

#endif // ndef brushed_mode

if(send_telemetry){
#ifdef	USE_SERIAL_TELEMETRY
	  makeTelemPackage(degrees_celsius,
			           battery_voltage,
					   actual_current,
	  				   (uint16_t)consumed_current,
	  					e_rpm);
	  send_telem_DMA();
	  send_telemetry = 0;
#endif
	}
#if defined(FIXED_DUTY_MODE) || defined(FIXED_SPEED_MODE)

//		if(INPUT_PIN_PORT->IDR & INPUT_PIN){
//			signaltimeout ++;
//			if(signaltimeout > 10000){
//				NVIC_SystemReset();
//			}
//		}else{
//			signaltimeout = 0;
//		}
#else
	  
		signaltimeout++;
	
