Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
		if(signaltimeout > 5000) { // quarter second timeout when armed half second for servo;
			if(armed){
				allOff();
				armed = 0;
				input = 0;
				inputSet = 0;
				zero_input_count = 0;
				
				TMR1->c1dt = 0;
			  TMR1->c2dt = 0;
				TMR1->c3dt = 0;

				IC_TIMER_REGISTER->div = 0;
				IC_TIMER_REGISTER->cval = 0;

				for(int i = 0; i < 64; i++){
					dma_buffer[i] = 0;
				}
				NVIC_SystemReset();
			}
#if !defined USE_DEBUG
		if ( signaltimeout > 50000){     // 5 second
			allOff();
			armed = 0;
			input = 0;
			inputSet = 0;
			zero_input_count = 0;
				
				TMR1->c1dt = 0;
			  TMR1->c2dt = 0;
				TMR1->c3dt = 0;
				IC_TIMER_REGISTER->div = 0;
				IC_TIMER_REGISTER->cval = 0;
			for(int i = 0; i < 64; i++){
				dma_buffer[i] = 0;
			}
			NVIC_SystemReset();
		}
#endif

			}
#endif
}


void advanceincrement(){
if (!forward){
	phase_A_position ++;
    if (phase_A_position > 359){
	   phase_A_position = 0 ;
    }
	    phase_B_position ++;
	     if (phase_B_position > 359){
		phase_B_position = 0 ;
	}
	    phase_C_position ++;
	     if (phase_C_position > 359){
		phase_C_position = 0 ;
	}
}else{
	       phase_A_position --;
	    if (phase_A_position < 0){
		   phase_A_position = 359 ;
	    }
		    phase_B_position --;
		     if (phase_B_position < 0){
			phase_B_position = 359;
		}
		    phase_C_position --;
		     if (phase_C_position < 0){
			phase_C_position = 359 ;
		}
}
#ifdef GIMBAL_MODE
    TMR1->c1dt = ((2*pwmSin[phase_A_position])+gate_drive_offset)*TIMER1_MAX_ARR/2000;
    TMR1->c2dt = ((2*pwmSin[phase_B_position])+gate_drive_offset)*TIMER1_MAX_ARR/2000;
    TMR1->c3dt = ((2*pwmSin[phase_C_position])+gate_drive_offset)*TIMER1_MAX_ARR/2000;
#else
    TMR1->c1dt = (((2*pwmSin[phase_A_position]/SINE_DIVIDER)+gate_drive_offset)*TIMER1_MAX_ARR/2000)*sine_mode_power / 10;
    TMR1->c2dt = (((2*pwmSin[phase_B_position]/SINE_DIVIDER)+gate_drive_offset)*TIMER1_MAX_ARR/2000)*sine_mode_power / 10;
    TMR1->c3dt = (((2*pwmSin[phase_C_position]/SINE_DIVIDER)+gate_drive_offset)*TIMER1_MAX_ARR/2000)*sine_mode_power / 10;
#endif
}

void commutateProcess(uint8_t real_zero_cross){
		commutate();
    bemfcounter = 0;
    bad_count = 0;

    if(real_zero_cross){
    	zero_crosses++;
    }
#ifdef POWER_ON_TEST_MODE
	if(zero_crosses > power_on_test_zero_cross_peak){
		power_on_test_zero_cross_peak = zero_crosses;
	}
#endif
    if(stall_protection || RC_CAR_REVERSE){
   	 if (zero_crosses >= 20 && commutation_interval <= 2000) {
   	    	old_routine = 0;
   	    	enableCompInterrupts();          // enable interrupt

    	 }
    }else{
	    	if(zero_crosses > 30
#ifdef POWER_ON_TEST_MODE
				&& power_on_test_closed_loop
				&& commutation_interval <= POWER_ON_TEST_INTERRUPT_COMM_INTERVAL
#endif
			){
	    	old_routine = 0;
    	enableCompInterrupts();          // enable interrupt

    }
   }
}
void zcfoundroutine(uint8_t forced_commutation){   // only used in polling mode, blocking routine.
	thiszctime = INTERVAL_TIMER->cval;
#ifdef POWER_ON_TEST_MODE
	if(!forced_commutation){
		// Ignore commutation ringing and hand-generated transitions during the
		// slow forced ramp. A usable crossing must arrive near mid-sector after
		// the ramp has reached acquisition speed.
		if(comm_timeout > POWER_ON_TEST_BEMF_ACQUIRE_INTERVAL ||
			thiszctime < (comm_timeout / 4) ||
			thiszctime > comm_timeout){
			bemfcounter = 0;
			bad_count = 0;
			zcfound = 0;
			return;
		}
		power_on_test_acquire_timeouts = 0;
		if(power_on_test_valid_zero_crosses < 255){
			power_on_test_valid_zero_crosses++;
		}
		if(power_on_test_valid_zero_crosses >= POWER_ON_TEST_REQUIRED_VALID_ZC){
			power_on_test_closed_loop = 1;
		}
	}
#endif
	INTERVAL_TIMER->cval = 0;
	commutation_interval = (thiszctime + (3*commutation_interval)) / 4;
	advance = commutation_interval / advancedivisor;
	waitTime = commutation_interval /2  - advance;
	inner_step=-1;
	while (INTERVAL_TIMER->cval < waitTime){
	}
	commutateProcess(!forced_commutation);
}

inline int inrange(int target,int val,int percent){
	return val < target*(100+percent)/100 && val > target*(100-percent)/100;
}
const uint8_t detectorNotes[]={0xa0,0x19,0xe0,0,0xa0,0x19,0xe0,0,0xa0,0x19,0xe0,0,0xa0,0x19,0xe0,0,0xa0,0x19,0xe0,0,0xa0,0x19,0xe0,0};
uint8_t bjNotesTemp[4*8];
uint16_t alldiagnose_data[4*3];
char phaseError[3];
char compErrorTemp[12];
char compError[4];	
void SystemDiagnose(){
	__disable_irq();	
	ADC_Init_Detector();
	delayMillis(100);
	playBlueJayTune(detectorNotes,0,sizeof(detectorNotes),1);

	int voltateAverage=0;
	int effectiveVolateCount=0;
	for(int i=0;i<3;++i){
		allOff();
		TMR1->c1dt=0;
		TMR1->c2dt=0;
		TMR1->c3dt=0;
		switch(i){//charging
			case 0:
				phaseAPWM();
				delayMillis(1);
			break;
			case 1:
				phaseBPWM();
				delayMillis(1);
			break;
			case 2:
				phaseCPWM();
				delayMillis(1);
			break;
		}
		TMR1->c1dt=TMR1->pr+1;
		TMR1->c2dt=TMR1->pr+1;
		TMR1->c3dt=TMR1->pr+1;
		delayMicros(500);
		adc_ordinary_software_trigger_enable(ADC1, TRUE);
		while(dma_flag_get(DMA1_FDT1_FLAG) == RESET);
		dma_flag_clear(DMA1_FDT1_FLAG);
		for(int j=0;j<4;++j){
			alldiagnose_data[i*4+j]=adc_diagnose_data[j];
			if(adc_diagnose_data[j]>100){				
				voltateAverage+=adc_diagnose_data[j];
				++effectiveVolateCount;
			}
		}
	}
	if(effectiveVolateCount>0){
		voltateAverage=voltateAverage/effectiveVolateCount;
	}else{
		voltateAverage=1000;
	}
	TMR1->c1dt=0;
	TMR1->c2dt=0;
	TMR1->c3dt=0;
	allOff();
	delayMillis(100);
	

	for(int i=0;i<3;++i){
		for(int j=0;j<4;++j){
			compErrorTemp[i*4+j]=!inrange(voltateAverage,alldiagnose_data[i*4+j],5);
		}
		phaseError[i]=compErrorTemp[i*4+0] & compErrorTemp[i*4+1] & compErrorTemp[i*4+2] & compErrorTemp[i*4+3];
	}
	for(int j=0;j<4;++j){
		compError[j]=compErrorTemp[0*4+j]&compErrorTemp[1*4+j]&compErrorTemp[2*4+j];
	}
	

	for(int i=0;i<8;++i){
		bjNotesTemp[i*4]=0xa0;
		if(i<1){
			bjNotesTemp[i*4+1]=0x21;
		}else if(i<4){
			bjNotesTemp[i*4+1]=phaseError[i-1]?0:0x19;
		}else{
			bjNotesTemp[i*4+1]=compError[i-4]?0:0x19;
		}
		bjNotesTemp[i*4+2]=0xe0;
		bjNotesTemp[i*4+3]=0;		
	}
	playBlueJayTune(bjNotesTemp,0,sizeof(bjNotesTemp),0);			
	__enable_irq();
}

int main(void)
{
	__enable_irq();

 adc_counter = 2;
 initCorePeripherals();
	
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_1, TRUE);
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_2, TRUE);
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_3, TRUE);
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_1C, TRUE);
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_2C, TRUE);
	tmr_channel_enable(TMR1, TMR_SELECT_CHANNEL_3C, TRUE);


  /* Enable tim1 */
 TMR1->ctrl1_bit.tmren = TRUE;
 TMR1->brk_bit.oen = TRUE;
 
 /* Force update generation */
TMR1->swevt |= TMR_OVERFLOW_SWTRIG;


