Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
adc_counter = 4;
#ifdef USE_RGB_LED
  LED_GPIO_init();
  GPIOB->BRR = LL_GPIO_PIN_8; // turn on red
  GPIOB->BSRR = LL_GPIO_PIN_5;
  GPIOB->BSRR = LL_GPIO_PIN_3; //
#endif

#ifndef BRUSHED_MODE             // commutation_timer priority 0
	  COM_TIMER->ctrl1_bit.tmren = TRUE;
    COM_TIMER->swevt |= TMR_OVERFLOW_SWTRIG;
    COM_TIMER->iden &= ~TMR_OVF_INT;
   #endif

 UTILITY_TIMER->ctrl1_bit.tmren = TRUE;
 //delayMillis(2000);

INTERVAL_TIMER->ctrl1_bit.tmren = TRUE;
INTERVAL_TIMER->swevt |= TMR_OVERFLOW_SWTRIG;
//TMR6->ists = (uint16_t)~TMR_OVF_FLAG;
INTERVAL_TIMER->iden |= TMR_OVF_INT;


adc_counter = 5;

 TEN_KHZ_TIMER->ctrl1_bit.tmren = TRUE;
 TEN_KHZ_TIMER->swevt |= TMR_OVERFLOW_SWTRIG;
 TEN_KHZ_TIMER->iden |= TMR_OVF_INT;


adc_counter = 6;
loadEEpromSettings();
  if(VERSION_MAJOR != eepromBuffer[3] || VERSION_MINOR != eepromBuffer[4]){
	  eepromBuffer[3] = VERSION_MAJOR;
	  eepromBuffer[4] = VERSION_MINOR;
	  for(int i = 0; i < 12 ; i ++){
		  eepromBuffer[5+i] = (uint8_t)FIRMWARE_NAME[i];
	  }
	  saveEEpromSettings();
  }

  if(use_sin_start){
  min_startup_duty = sin_mode_min_s_d;
  }
#ifdef POWER_ON_TEST_MODE
	forward = POWER_ON_TEST_FORWARD;
#else
	if (dir_reversed == 1){
			forward = 0;
		}else{
			forward = 1;
		}
#endif
	tim1_arr = TIMER1_MAX_ARR;
	startup_max_duty_cycle = startup_max_duty_cycle * TIMER1_MAX_ARR / 2000  + dead_time_override;  // adjust for pwm frequency
	throttle_max_at_low_rpm  = throttle_max_at_low_rpm * TIMER1_MAX_ARR / 2000;  // adjust to new pwm frequency
    throttle_max_at_high_rpm = TIMER1_MAX_ARR;  // adjust to new pwm frequency
	if(!comp_pwm){
		use_sin_start = 0;  // sine start requires complementary pwm.
	}
adc_counter = 7;
	if (RC_CAR_REVERSE) {         // overrides a whole lot of things!
		throttle_max_at_low_rpm = 1000;
		bi_direction = 1;
		use_sin_start = 0;
		low_rpm_throttle_limit = 1;
		VARIABLE_PWM = 0;
		//stall_protection = 1;
		comp_pwm = 0;
    stuck_rotor_protection = 0;
		minimum_duty_cycle = minimum_duty_cycle + 50;
		stall_protect_minimum_duty = stall_protect_minimum_duty + 50;
		min_startup_duty = min_startup_duty + 50;
	}
if(eepromBuffer[39]==1){//hull senser
	SystemDiagnose();
}
#ifdef USE_ADC
   ADC_Init();
#endif

#ifdef USE_ADC_INPUT

#else
tmr_channel_enable(IC_TIMER_REGISTER, IC_TIMER_CHANNEL, TRUE);
IC_TIMER_REGISTER->ctrl1_bit.tmren = TRUE;

#endif

#ifdef MCU_F031
	  GPIOF->BSRR = LL_GPIO_PIN_6;            // uncomment to take bridge out of standby mode and set oc level
	  GPIOF->BRR = LL_GPIO_PIN_7;				// out of standby mode
	  GPIOA->BRR = LL_GPIO_PIN_11;
#endif

#if defined(FIXED_DUTY_MODE) || defined(FIXED_SPEED_MODE)
 MX_IWDG_Init();
 WDT->cmd = WDT_CMD_RELOAD;
 inputSet = 1;
 armed = 1;
 adjusted_input = 48;
 newinput = 48;
#ifdef POWER_ON_TEST_MODE
 motor_kv = POWER_ON_TEST_MOTOR_KV;
 motor_poles = POWER_ON_TEST_MOTOR_POLES;
 advance_level = POWER_ON_TEST_ADVANCE_LEVEL;
 // Convert the 0..2000 test scale to the active 4000-count PWM period.
 // The old raw assignment produced only about 7.5% effective startup duty.
 min_startup_duty = POWER_ON_TEST_MIN_STARTUP_DUTY * TIMER1_MAX_ARR / 2000 + dead_time_override;
 minimum_duty_cycle = (POWER_ON_TEST_MIN_STARTUP_DUTY / 2) * TIMER1_MAX_ARR / 2000 + dead_time_override;
 startup_max_duty_cycle = POWER_ON_TEST_STARTUP_MAX_DUTY * TIMER1_MAX_ARR / 2000 + dead_time_override;
 stall_protect_minimum_duty = minimum_duty_cycle;
 min_bemf_counts_up = POWER_ON_TEST_MIN_BEMF_COUNTS;
 min_bemf_counts_down = POWER_ON_TEST_MIN_BEMF_COUNTS;
 stuck_rotor_protection = 0;
 use_sin_start = 0;
 low_rpm_throttle_limit = 0;
#endif
#ifdef FIXED_SPEED_MODE
 use_speed_control_loop = 1;
 use_sin_start = 0;
 target_e_com_time = 60000000 / FIXED_SPEED_MODE_RPM / (motor_poles/2) ;
 input = 48;
#endif

#else
#ifdef BRUSHED_MODE
		maskPhaseInterrupts();
	 	commutation_interval = 5000;
	 	use_sin_start = 0;
		playBrushedStartupTune();
#else
	 //  playStartupTune();
#endif
	   zero_input_count = 0;
	   MX_IWDG_Init();
     WDT->cmd = WDT_CMD_RELOAD;

#ifdef GIMBAL_MODE
	bi_direction = 1;
	use_sin_start = 1;
#endif

#ifdef USE_ADC_INPUT
   armed_count_threshold = 5000;
   inputSet = 1;

#else
adc_counter = 8;

UN_TIM_Init();
receiveDshotDma();
 
if(drive_by_rpm){
	 use_speed_control_loop = 1;
 }
#endif

#endif      // end fixed duty mode ifdef

adc_counter = 9;


 while (1)
  {
WDT->cmd = WDT_CMD_RELOAD;

	  adc_counter++;
	  if(adc_counter>200){   // for testing adc and telemetry

					ADC_raw_temp = ADC_raw_temp - (temperature_offset);
					converted_degrees =(12600 - (int32_t)ADC_raw_temp * 33000 / 4096) / -42 + 25;
					degrees_celsius =(7 * degrees_celsius + converted_degrees) >> 3;
          battery_voltage = ((7 * battery_voltage) + ((ADC_raw_volts * 3300 / 4095 * VOLTAGE_DIVIDER)/100)) >> 3;
          smoothed_raw_current = ((7*smoothed_raw_current + (ADC_raw_current) )>> 3);
          actual_current = (smoothed_raw_current * 3300/41) / (MILLIVOLT_PER_AMP)  + CURRENT_OFFSET;

			adc_ordinary_software_trigger_enable(ADC1, TRUE);
			

		  if(LOW_VOLTAGE_CUTOFF){
			  if(battery_voltage < (cell_count * low_cell_volt_cutoff)){
				  low_voltage_count++;
				  if(low_voltage_count > (20000 - (stepper_sine * 900))){
				  input = 0;
				  allOff();
				  maskPhaseInterrupts();
				  running = 0;
				  zero_input_count = 0;
				  armed = 0;

				  }
			  }else{
				  low_voltage_count = 0;
			  }
		  }
		  adc_counter = 0;
#ifdef USE_ADC_INPUT
		  if(ADC_raw_input < 10){
			  zero_input_count++;
		  }else{
			  zero_input_count=0;
		  }
#endif
	  }
#ifdef USE_ADC_INPUT

signaltimeout = 0;
ADC_smoothed_input = (((10*ADC_smoothed_input) + ADC_raw_input)/11);
newinput = ADC_smoothed_input / 2;
if(newinput > 2000){
	newinput = 2000;
}
#endif
	  stuckcounter = 0;

  		  if (bi_direction == 1 && dshot == 0){
  			  if(RC_CAR_REVERSE){
  				  if (newinput > (1000 + (servo_dead_band<<1))) {
  					  if (forward == dir_reversed) {
  						  adjusted_input = 0;
  						  if(running){
  							  prop_brake_active = 1;
  						  }else{
  							  forward = 1 - dir_reversed;
  						  }
  					  }
  					  if (prop_brake_active == 0) {
  						  adjusted_input = map(newinput, 1000 + (servo_dead_band<<1), 2000, 47, 2047);
  					  }
  				  }
  				  if (newinput < (1000 -(servo_dead_band<<1))) {
  					  if (forward == (1 - dir_reversed)) {
  						  if(running){
  							  prop_brake_active = 1;
  						  }else{
  							  forward = dir_reversed;
  						  }
  						  adjusted_input = 0;

