Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
  					  }
  					  if (prop_brake_active == 0) {
  						  adjusted_input = map(newinput, 0, 1000-(servo_dead_band<<1), 2047, 47);
  					  }
  				  }


  				  if (newinput >= (1000 - (servo_dead_band << 1)) && newinput <= (1000 + (servo_dead_band <<1))) {
  					  adjusted_input = 0;
  					  prop_brake_active = 0;
  				  }
  			  }else{
  				  if (newinput > (1000 + (servo_dead_band<<1))) {
  					  if (forward == dir_reversed) {
  						  if((commutation_interval > reverse_speed_threshold )|| stepper_sine){
  							  forward = 1 - dir_reversed;
  							  zero_crosses = 0;
  							  old_routine = 1;
  							  maskPhaseInterrupts();
  							brushed_direction_set = 0;
  						  }else{
  							  newinput = 1000;
  						  }
  					  }
  					  adjusted_input = map(newinput, 1000 + (servo_dead_band<<1), 2000, 47, 2047);
  				  }
  				  if (newinput < (1000 -(servo_dead_band<<1))) {
  					  if (forward == (1 - dir_reversed)) {
  						  if((commutation_interval > reverse_speed_threshold) || stepper_sine){
  							  zero_crosses = 0;
  							  old_routine = 1;
  							  forward = dir_reversed;
  							  maskPhaseInterrupts();
  							brushed_direction_set = 0;
  						  }else{
  							  newinput = 1000;

  						  }
  					  }
  					  adjusted_input = map(newinput, 0, 1000-(servo_dead_band<<1), 2047, 47);
  				  }

 				  if (newinput >= (1000 - (servo_dead_band << 1)) && newinput <= (1000 + (servo_dead_band <<1))) {
  					  adjusted_input = 0;
  					brushed_direction_set = 0;
  				  }
  			  }
 		  }else if (dshot && bi_direction) {
  			  if (newinput > 1047) {

  				  if (forward == dir_reversed) {
  					  if(commutation_interval > reverse_speed_threshold || stepper_sine){
  						  forward = 1 - dir_reversed;
  						  zero_crosses = 0;
  						  old_routine = 1;
  						  maskPhaseInterrupts();
  						brushed_direction_set = 0;
  					  }else{
  						  newinput = 0;

  					  }
  				  }
  				  adjusted_input = ((newinput - 1048) * 2 + 47) - reversing_dead_band;

  			  }
  			  if (newinput <= 1047  && newinput > 47) {
  				  //	startcount++;

  				  if (forward == (1 - dir_reversed)) {
  					  if(commutation_interval > reverse_speed_threshold || stepper_sine){
  						  zero_crosses = 0;
  						  old_routine = 1;
  						  forward = dir_reversed;
  						  maskPhaseInterrupts();
  						brushed_direction_set = 0;
  					  }else{
  						  newinput = 0;

  					  }
  				  }
  				  adjusted_input = ((newinput - 48) * 2 + 47) - reversing_dead_band;
  			  }
  			  if ( newinput < 48) {
  				  adjusted_input = 0;
  				brushed_direction_set = 0;
  			  }


  		  }else{
  			  adjusted_input = newinput;
  		  }
#ifndef BRUSHED_MODE

	 	 if ((zero_crosses > 1000) || (adjusted_input == 0)){
 	 		bemf_timeout_happened = 0;
#ifdef USE_RGB_LED
 	 		if(adjusted_input == 0 && armed){
			  GPIOB->BSRR = LL_GPIO_PIN_8; // off red
			  GPIOB->BRR = LL_GPIO_PIN_5;  // on green
			  GPIOB->BSRR = LL_GPIO_PIN_3;  //off blue
 	 		}
#endif
 	 	 }
	 	 if(zero_crosses > 100 && adjusted_input < 200){
	 		bemf_timeout_happened = 0;
	 	 }
	 	 if(use_sin_start && adjusted_input < 160){
	 		bemf_timeout_happened = 0;
	 	 }

 	 	 if(crawler_mode){
 	 		if (adjusted_input < 400){
 	 			bemf_timeout_happened = 0;
 	 		}
 	 	 }else{
 	 		if (adjusted_input < 150){              // startup duty cycle should be low enough to not burn motor
 	 			bemf_timeout = 100;
 	 	 	 }else{
 	 	 		bemf_timeout = 10;
 	 	 	 }
 	 	 }
	  if(bemf_timeout_happened > bemf_timeout * ( 1 + (crawler_mode*100))&& stuck_rotor_protection){
	 		stopStuckMotor();
	 	 }else{
#ifdef FIXED_DUTY_MODE
#ifdef POWER_ON_TEST_MODE
			if(power_on_test_fault){
				input = 0;
			}else{
				input = FIXED_DUTY_MODE_POWER * 20;
			}
#else
  			input = FIXED_DUTY_MODE_POWER * 20;
#endif
#else
	  	  	if(use_sin_start){
  				if(adjusted_input < 30){           // dead band ?
  					input= 0;
  					}

  					if(adjusted_input > 30 && adjusted_input < (sine_mode_changeover_thottle_level * 20)){
  					input= map(adjusted_input, 30 , (sine_mode_changeover_thottle_level * 20) , 47 ,160);
  					}
  					if(adjusted_input >= (sine_mode_changeover_thottle_level * 20)){
  					input = map(adjusted_input , (sine_mode_changeover_thottle_level * 20) ,2000 , 160, 2000);
  					}
  				}else{
  					if(use_speed_control_loop){
  					  if (drive_by_rpm){
 						target_e_com_time = 60000000 / map(adjusted_input , 47 ,2047 , MINIMUM_RPM_SPEED_CONTROL, MAXIMUM_RPM_SPEED_CONTROL) / (motor_poles/2);
  		  				if(adjusted_input < 47){           // dead band ?
  		  					input= 0;
  		  					speedPid.error = 0;
  		  				    input_override = 0;
  		  				}else{
  	  						input = (uint16_t)input_override;  // speed control pid override
  	  						if(input_override > 2047){
  	  							input = 2047;
  	  						}
  	  						if(input_override < 48){
  	  							input = 48;
  	  						}
  		  				}
					    }else{

  						input = (uint16_t)input_override;  // speed control pid override
  						if(input_override > 1999){
  							input = 1999;
  						}
  						if(input_override < 48){
  							input = 48;
  						}
					    }
  					}else{

  						input = adjusted_input;

  					}
  				}
#endif
	 	  }
		  if ( stepper_sine == 0){

  e_rpm = running * (100000/ e_com_time) * 6;       // in tens of rpm
  k_erpm =  e_rpm / 10; // ecom time is time for one electrical revolution in microseconds

  if(low_rpm_throttle_limit){     // some hardware doesn't need this, its on by default to keep hardware / motors protected but can slow down the response in the very low end a little.

  duty_cycle_maximum = map(k_erpm, low_rpm_level, high_rpm_level, throttle_max_at_low_rpm, throttle_max_at_high_rpm);   // for more performance lower the high_rpm_level, set to a consvervative number in source.
   }

   if(degrees_celsius > TEMPERATURE_LIMIT){
	   duty_cycle_maximum = map(degrees_celsius, TEMPERATURE_LIMIT, TEMPERATURE_LIMIT+20, throttle_max_at_high_rpm/2, 1);
   }



#if defined(FAST_INTERRUPT)
	if (zero_crosses < 100 || commutation_interval > 500) {
		filter_level = 12;
	} else {
		filter_level = map(average_interval, 100 , 500, 4 , 12);
	}
#else
	if (zero_crosses < 100 || commutation_interval > 500) {
		filter_level = 8;
	} else {
		filter_level = map(average_interval, 100 , 500, 2 , 8);
	}
#endif
	
	if (commutation_interval < 100){
		filter_level = 2;
	}

