Wwwudidechuanshuo/BLDC_AT32F421K8U7_V0.5_Test/src/main.c
if(motor_kv < 900){

	filter_level = filter_level * 2;
}

/**************** old routine*********************/
if (old_routine && running){
	maskPhaseInterrupts();
	 		 getBemfState();
	 	  if (!zcfound){
	 		  if (rising){
	 		 if (bemfcounter > min_bemf_counts_up){
	 			 zcfound = 1;
	 		 zcfoundroutine(0);
	 		}
	 		  }else{
	 			  if (bemfcounter > min_bemf_counts_down){
 			  			 zcfound = 1;
	 			 zcfoundroutine(0);
	 			  		}
	 		  }
	 	  }
}
#if defined(COMM_TIMEOUT_PROCESS)
			COMM_TIMEOUT_PROCESS;			
#endif

	 	  if (INTERVAL_TIMER->cval > comm_timeout  && running == 1){//zc timeout
				IntervalTimerOverflowProcess(0);
	 	  }
	 	  }else{            // stepper sine

#ifdef GIMBAL_MODE
	 				step_delay = 300;
	 				maskPhaseInterrupts();
	 				allpwm();
	 				if(newinput>1000){
	 					desired_angle = map(newinput, 1000, 2000, 180, 360);
	 				}else{
	 					desired_angle = map(newinput, 0, 1000, 0, 180);
	 				}
	 				if(current_angle > desired_angle){
	 					forward = 1;
	 					advanceincrement();
	 					delayMicros(step_delay);
	 					current_angle--;
	 				}
	 				if(current_angle < desired_angle){
	 					forward = 0;
	 					advanceincrement();
	 					delayMicros(step_delay);
	 					current_angle++;
	 				}
#else



if(input > 48 && armed){

	 		  if (input > 48 && input < 137){// sine wave stepper
         running = 1;
	 			 maskPhaseInterrupts();
	 			 allpwm();
	 		 advanceincrement();
             step_delay = map (input, 48, 120, 7000/motor_poles, 1000/motor_poles);
	 		 delayMicros(step_delay);
			 e_rpm =   600/ step_delay ;         // in hundreds so 33 e_rpm is 3300 actual erpm
				if(step_delay < 181){
					e_com_time = step_delay * 360;
				}else{ 
					e_com_time = 65535;
				}
	 		  }else{
	 			 advanceincrement();
	 			  if(input > 200){
	 				 phase_A_position = 0;
	 				 step_delay = 80;
	 			  }

	 			 delayMicros(step_delay);
	 			  if (phase_A_position == 0){
	 			  stepper_sine = 0;
	 			  running = 1;
				  old_routine = 1;
		 		  commutation_interval = 9000;
		 		  average_interval = 9000;
				  last_average_interval = average_interval;
						INTERVAL_TIMER->cval = 9000;
				  zero_crosses = 10;
				  prop_brake_active = 0;
	 			  step = changeover_step;                    // rising bemf on a same as position 0.
		 		// comStep(step);// rising bemf on a same as position 0.
				if(stall_protection){
				minimum_duty_cycle = stall_protect_minimum_duty;
				}
	 			commutate();
				TMR1->swevt |= TMR_OVERFLOW_SWTRIG;
	 			  }
	 		  }

}else{
	if(brake_on_stop){
#ifndef PWM_ENABLE_BRIDGE
	duty_cycle = (TIMER1_MAX_ARR-19) + drag_brake_strength*2;
	adjusted_duty_cycle = TIMER1_MAX_ARR - ((duty_cycle * tim1_arr)/TIMER1_MAX_ARR)+1;

TMR1->c1dt = adjusted_duty_cycle;
TMR1->c2dt = adjusted_duty_cycle;
TMR1->c3dt = adjusted_duty_cycle;
	proportionalBrake();
	prop_brake_active = 1;
#else
		// todo add braking for PWM /enable style bridges.
#endif
	}else{
		TMR1->c1dt = 0;
		TMR1->c2dt = 0;
		TMR1->c3dt = 0;
		allOff();
	}
	running = 0;
}

#endif      // gimbal mode
	 }  // stepper/sine mode end
#endif    // end of brushless mode

#ifdef BRUSHED_MODE
          TMR14->c1dt = adjusted_input;
	  			if(brushed_direction_set == 0 && adjusted_input > 48){
	  				if(forward){
	  					allOff();
	  					delayMicros(10);
	  					twoChannelForward();
	  				}else{
	  					allOff();
	  					delayMicros(10);
	  					twoChannelReverse();
	  				}
	  				brushed_direction_set = 1;
	  			}
	  			if(adjusted_input > 1900){
	  				adjusted_input = 1900;
	  			}
	  			input = map(adjusted_input, 48, 2047, 0, TIMER1_MAX_ARR);

	  			if(input > 0 && armed){
	  				TMR1->c1dt = input;												// set duty cycle to 50 out of 768 to start.
	  				TMR1->c2dt = input;
	  				TMR1->c3dt = input;
	  			}else{
	  				TMR1->c1dt = 0;												// set duty cycle to 50 out of 768 to start.
	  				TMR1->c2dt = 0;
	  				TMR1->c3dt = 0;
	  			}
#endif
  		}
}
